import { create, all, BigNumber, ConfigOptions } from 'mathjs';
import { UserInput, SlotModel } from "./type";

const config: ConfigOptions = {
    number: 'BigNumber'
};
const math = create(all, config);

/* ユーザ入力情報管理 */
export const userInputStr: UserInput = {
    modelName: '',
    n: [],
    x: [],
    w: [],
}

/* bignumber定数 */
export const one = math.bignumber(1);
export const zero = math.bignumber(0);
export const hundred = math.bignumber(100);

/* 台データ（データ元） */
/*
    レギュレーション
    type: 'SlotDataSource'
    modelName: 日本語文字列
    settingNames: 設定名のリスト
    flagNames: フラグ名のリスト、各フラグが互いに排他関係にあること、はずれフラグは含まないものとする
    ptable: 各設定におけるフラグ成立確率、float、ptable[設定][フラグ]=>成立確率、はずれフラグは含まないものとする
*/
export const slotDataSources_ = [
    {
        modelName: 'アイムジャグラー',
        settingNames: ['設定_1', '設定_2', '設定_3', '設定_4', '設定_5', '設定_6',],
        flagNames: ['grape', 'singleBig', 'cherryBig', 'singleReg', 'cherryReg',],
        ptable: [
            [1 / 6.02, 1 / 389.2, 1 / 915.8, 1 / 633.4, 1 / 1439.3,],
            [1 / 6.02, 1 / 381.5, 1 / 920.0, 1 / 568.7, 1 / 1344.1,],
            [1 / 6.02, 1 / 381.5, 1 / 920.0, 1 / 471.4, 1 / 1111.1,],
            [1 / 6.02, 1 / 370.0, 1 / 863.2, 1 / 446.3, 1 / 1071.1,],
            [1 / 6.02, 1 / 370.0, 1 / 863.2, 1 / 361.7, 1 / 864.1,],
            [1 / 5.78, 1 / 361.7, 1 / 864.1, 1 / 361.7, 1 / 864.1,],
        ],
    },
    {
        modelName: 'マイジャグラー5',
        settingNames: ['設定_1', '設定_2', '設定_3', '設定_4', '設定_5', '設定_6',],
        flagNames: ['grape', 'singleBig', 'cherryBig', 'singleReg', 'cherryReg',],
        ptable: [
            [1 / 5.90, 1 / 382.1, 1 / 1383.9, 1 / 635.2, 1 / 1152.8],
            [1 / 5.86, 1 / 380.8, 1 / 1336.6, 1 / 559.6, 1 / 1239.1],
            [1 / 5.83, 1 / 373.9, 1 / 1304.7, 1 / 488.9, 1 / 1075.7],
            [1 / 5.83, 1 / 357.9, 1 / 1211.2, 1 / 406.0, 1 / 1014.9],
            [1 / 5.83, 1 / 335.5, 1 / 1155.8, 1 / 377.3, 1 / 932.2],
            [1 / 5.79, 1 / 318.0, 1 / 1113.0, 1 / 318.0, 1 / 820.1],
        ],
    },
    {
        modelName: 'ファンキージャグラー2',
        settingNames: ['設定_1', '設定_2', '設定_3', '設定_4', '設定_5', '設定_6',],
        flagNames: ['grape', 'singleBig', 'cherryBig', 'singleReg', 'cherryReg',],
        ptable: [
            [1 / 5.92, 1 / 357.9, 1 / 1048.3, 1 / 650.7, 1 / 1478.0],
            [1 / 5.91, 1 / 345.4, 1 / 1029.0, 1 / 568.0, 1 / 1390.9],
            [1 / 5.90, 1 / 353.1, 1 / 971.8, 1 / 500.1, 1 / 1278.5],
            [1 / 5.88, 1 / 330.6, 1 / 995.9, 1 / 444.7, 1 / 1210.4],
            [1 / 5.83, 1 / 328.5, 1 / 923.9, 1 / 410.0, 1 / 1241.2],
            [1 / 5.81, 1 / 295.4, 1 / 917.1, 1 / 345.8, 1 / 1061.9],
        ],
    },
];

export const slotModelDataSources: SlotModel[] = [
    {
        modelName: 'アイムジャグラー',
        settingNames: ['設定_1', '設定_2', '設定_3', '設定_4', '設定_5', '設定_6',],
        modeNames: ['通常時'],
        elementNames: [
            ['grape', 'singleBig', 'cherryBig', 'singleReg', 'cherryReg',],
        ],
        table: [
            [[1 / 6.02, 1 / 389.2, 1 / 915.8, 1 / 633.4, 1 / 1439.3,],],
            [[1 / 6.02, 1 / 381.5, 1 / 920.0, 1 / 568.7, 1 / 1344.1,],],
            [[1 / 6.02, 1 / 381.5, 1 / 920.0, 1 / 471.4, 1 / 1111.1,],],
            [[1 / 6.02, 1 / 370.0, 1 / 863.2, 1 / 446.3, 1 / 1071.1,],],
            [[1 / 6.02, 1 / 370.0, 1 / 863.2, 1 / 361.7, 1 / 864.1,],],
            [[1 / 5.78, 1 / 361.7, 1 / 864.1, 1 / 361.7, 1 / 864.1,],],
        ],
    },
    {
        modelName: 'マイジャグラー5',
        settingNames: ['設定_1', '設定_2', '設定_3', '設定_4', '設定_5', '設定_6',],
        modeNames: ['通常時'],
        elementNames: [
            ['grape', 'singleBig', 'cherryBig', 'singleReg', 'cherryReg',],
        ],
        table: [
            [[1 / 5.90, 1 / 382.1, 1 / 1383.9, 1 / 635.2, 1 / 1152.8],],
            [[1 / 5.86, 1 / 380.8, 1 / 1336.6, 1 / 559.6, 1 / 1239.1],],
            [[1 / 5.83, 1 / 373.9, 1 / 1304.7, 1 / 488.9, 1 / 1075.7],],
            [[1 / 5.83, 1 / 357.9, 1 / 1211.2, 1 / 406.0, 1 / 1014.9],],
            [[1 / 5.83, 1 / 335.5, 1 / 1155.8, 1 / 377.3, 1 / 932.2],],
            [[1 / 5.79, 1 / 318.0, 1 / 1113.0, 1 / 318.0, 1 / 820.1],],
        ],
    },
    {
        modelName: 'ファンキージャグラー2',
        settingNames: ['設定_1', '設定_2', '設定_3', '設定_4', '設定_5', '設定_6',],
        modeNames: ['通常時'],
        elementNames: [
            ['grape', 'singleBig', 'cherryBig', 'singleReg', 'cherryReg',],
        ],
        table: [
            [[1 / 5.92, 1 / 357.9, 1 / 1048.3, 1 / 650.7, 1 / 1478.0],],
            [[1 / 5.91, 1 / 345.4, 1 / 1029.0, 1 / 568.0, 1 / 1390.9],],
            [[1 / 5.90, 1 / 353.1, 1 / 971.8, 1 / 500.1, 1 / 1278.5],],
            [[1 / 5.88, 1 / 330.6, 1 / 995.9, 1 / 444.7, 1 / 1210.4],],
            [[1 / 5.83, 1 / 328.5, 1 / 923.9, 1 / 410.0, 1 / 1241.2],],
            [[1 / 5.81, 1 / 295.4, 1 / 917.1, 1 / 345.8, 1 / 1061.9],],
        ],
    },
    {
        modelName: 'アイムジャグラー（ぶどうなし）',
        settingNames: ['設定_1', '設定_2', '設定_3', '設定_4', '設定_5', '設定_6',],
        modeNames: ['通常時'],
        elementNames: [
            ['singleBig', 'cherryBig', 'singleReg', 'cherryReg',],
        ],
        table: [
            [[1 / 389.2, 1 / 915.8, 1 / 633.4, 1 / 1439.3,],],
            [[1 / 381.5, 1 / 920.0, 1 / 568.7, 1 / 1344.1,],],
            [[1 / 381.5, 1 / 920.0, 1 / 471.4, 1 / 1111.1,],],
            [[1 / 370.0, 1 / 863.2, 1 / 446.3, 1 / 1071.1,],],
            [[1 / 370.0, 1 / 863.2, 1 / 361.7, 1 / 864.1,],],
            [[1 / 361.7, 1 / 864.1, 1 / 361.7, 1 / 864.1,],],
        ],
    },
    {
        modelName: '新ハナビ（RTリプレイ判別版）',
        settingNames: ['設定_1', '設定_2', '設定_5', '設定_6',],
        modeNames: ['通常時', '花火チャレンジ', '花火GAME', 'BIG中', 'REG中',],
        elementNames: [
            ['風鈴A', '風鈴B', '氷A', '氷B', 'チェリーA1', 'チェリーA2', 'チェリーB', 'BIG中', 'REG中'],
            ['ハズレ', '通常リプレイ'],
            ['ハズレ', '通常リプレイ', 'RTリプレイ'],
            ['斜め風鈴', 'ハズレ目'],
            ['1枚役', 'ハズレ（フラッシュ有り）'],
        ],
        table: [
            [
                [1 / 15.3, 1 / 15.3, 1 / 52.9, 1 / 1638.4, 1 / 99.4, 1 / 21.0, 1 / 282.5, 1 / 277.7, 1 / 356.2],
                [1 / 6.0, 1 / 3.0],
                [1 / 13.4, 1 / 7.3, 1 / 1.7],
                [1 / 11.0, 1 / 16384.0],
                [1 / 8.0, 0],
            ],
            [
                [1 / 14.9, 1 / 15.6, 1 / 53.5, 1 / 1638.4, 1 / 99.4, 1 / 19.3, 1 / 281.3, 1 / 268.6, 1 / 331.0],
                [1 / 5.8, 1 / 3.1],
                [1 / 12.4, 1 / 7.3, 1 / 1.7],
                [1 / 9.0, 1 / 16384.0],
                [1 / 8.0, 0],
            ],
            [
                [1 / 14.5, 1 / 15.3, 1 / 49.6, 1 / 1638.4, 1 / 99.3, 1 / 20.6, 1 / 276.5, 1 / 256.0, 1 / 306.2],
                [1 / 5.3, 1 / 3.3],
                [1 / 10.1, 1 / 7.3, 1 / 1.8],
                [1 / 11.0, 1 / 16384.0],
                [1 / 7.0, 1 / 376.6],
            ],
            [
                [1 / 14.1, 1 / 15.1, 1 / 50.8, 1 / 1638.4, 1 / 99.3, 1 / 19.9, 1 / 274.2, 1 / 248.2, 1 / 280.1],
                [1 / 5.1, 1 / 3.4],
                [1 / 9.5, 1 / 7.3, 1 / 1.8],
                [1 / 9.0, 1 / 655.4],
                [1 / 7.0, 1 / 376.6],
            ],
        ],
    },
    {
        modelName: '新ハナビ（RT簡易版）',
        settingNames: ['設定_1', '設定_2', '設定_5', '設定_6',],
        modeNames: ['通常時', '花火チャレンジ', '花火GAME', 'BIG中', 'REG中',],
        elementNames: [
            ['風鈴A', '風鈴B', '氷A', '氷B', 'チェリーA1', 'チェリーA2', 'チェリーB', 'BIG', 'REG'],
            ['ハズレ', '通常リプレイ'],
            ['ハズレ', 'リプレイ合計'],
            ['斜め風鈴', 'ハズレ目'],
            ['1枚役', 'ハズレ（フラッシュ有り）'],
        ],
        table: [
            [
                [1 / 15.3, 1 / 15.3, 1 / 52.9, 1 / 1638.4, 1 / 99.4, 1 / 21.0, 1 / 282.5, 1 / 277.7, 1 / 356.2],
                [1 / 6.0, 1 / 3.0],
                [1 / 13.4, 1 / 1.379],
                [1 / 11.0, 1 / 16384.0],
                [1 / 8.0, 0],
            ],
            [
                [1 / 14.9, 1 / 15.6, 1 / 53.5, 1 / 1638.4, 1 / 99.4, 1 / 19.3, 1 / 281.3, 1 / 268.6, 1 / 331.0],
                [1 / 5.8, 1 / 3.1],
                [1 / 12.4, 1 / 1.379],
                [1 / 9.0, 1 / 16384.0],
                [1 / 8.0, 0],
            ],
            [
                [1 / 14.5, 1 / 15.3, 1 / 49.6, 1 / 1638.4, 1 / 99.3, 1 / 20.6, 1 / 276.5, 1 / 256.0, 1 / 306.2],
                [1 / 5.3, 1 / 3.3],
                [1 / 10.1, 1 / 1.444],
                [1 / 11.0, 1 / 16384.0],
                [1 / 7.0, 1 / 376.6],
            ],
            [
                [1 / 14.1, 1 / 15.1, 1 / 50.8, 1 / 1638.4, 1 / 99.3, 1 / 19.9, 1 / 274.2, 1 / 248.2, 1 / 280.1],
                [1 / 5.1, 1 / 3.4],
                [1 / 9.5, 1 / 1.444],
                [1 / 9.0, 1 / 655.4],
                [1 / 7.0, 1 / 376.6],
            ],
        ],
    },
    {
        modelName: 'いろはに愛姫（押し順青7のみ）',
        settingNames: ['設定_左', '設定_右', '設定_中', '設定_6',],
        modeNames: ['押し順青7（左1st）'],
        elementNames: [
            ['成功',],
        ],
        table: [
            [[1 / 2,],],
            [[1 / 4,],],
            [[1 / 4,],],
            [[1 / 3,],],
        ],
    },
];
